صنف بطاقة
    عام نص رقم_البطاقة
    خاص رقم الرقم_السري
    عام نص الاسم
    
    باني(نص رقم، رقم سري، نص اسم)
        رقم_البطاقة = رقم
        الرقم_السري = سري
        الاسم = اسم
    نهاية
    
    عام دالة منطق تحقق(رقم سري_مدخل)
        رجع سري_مدخل == الرقم_السري
    نهاية
نهاية

بطاقة بطاقتي
بطاقتي = جديد بطاقة("1234567890"، 9876، "أحمد")

اطبع("معلومات عامة:")
اطبع(بطاقتي.رقم_البطاقة)
اطبع(بطاقتي.الاسم)

اطبع("التحقق:")
اطبع(بطاقتي.تحقق(9876))
اطبع(بطاقتي.تحقق(1111))

اطبع("محاولة الوصول للرقم السري:")
اطبع(بطاقتي.الرقم_السري)
