دالة مصفوفة أنشئ_قائمة(رقم حجم، رقم قيمة = 0)
    مصفوفة نتيجة = []
    رقم ع = 0
    بينما (ع < حجم)
        أضف(نتيجة، قيمة)
        ع = ع + 1
    نهاية
    إرجاع نتيجة
نهاية

دالة مصفوفة نطاق(رقم نهاية_نطاق = 10، رقم بداية = 0، رقم خطوة = 1)
    مصفوفة نتيجة = []
    رقم ع = بداية
    بينما (ع < نهاية_نطاق)
        أضف(نتيجة، ع)
        ع = ع + خطوة
    نهاية
    إرجاع نتيجة
نهاية

اطبع("أصفار =", أنشئ_قائمة(3))
اطبع("خمسات =", أنشئ_قائمة(5، 5))
اطبع("نطاق() =", نطاق())
اطبع("نطاق(5) =", نطاق(5))
