صنف مركبة
    نص نوع
    رقم سرعة
    
    دالة تحرك()
        سرعة = 50
        نوع = "مركبة"
    نهاية
    
    دالة وصف()
        نوع = "مركبة عامة"
    نهاية
نهاية

صنف سيارة : مركبة
    رقم عدد_ابواب
    
    دالة وصف()
        نوع = "سيارة"
        عدد_ابواب = 4
    نهاية
    
    دالة فتح_ابواب()
        عدد_ابواب = 0
    نهاية
نهاية

سيارة س
س = جديد سيارة()
س.نوع = "تويوتا"
س.سرعة = 100
س.عدد_ابواب = 4
س.تحرك()
س.وصف()
س.فتح_ابواب()
نص رسالة = "عدد الابواب"
اطبع (رسالة)
اطبع (س.عدد_ابواب)
